app/Controllers/Home.php

SELECT *
FROM `absensi`
---
    public function index()
    {
        $resign = $this->karyawanModel->resign2();
        $masuk = $this->karyawanModel->masuk2();
        $tahun = date("Y");
        for ($i = 1; $i <= 12; $i++) {
            if ($i < 10) {
                $bulan = "0$i";
            } else
                $bulan = "$i";

            $grap1 = $this->karyawanModel->graph_masuk($bulan, $tahun);
            $cek[] = count($grap1);
        }
        for ($i = 1; $i <= 12; $i++) {
            if ($i < 10) {
                $bulan = "0$i";
            } else
                $bulan = "$i";

            $grap2 = $this->karyawanModel->graph_resign($bulan, $tahun);
            $cek2[] = count($grap2);
        }
        $jabatan = $this->jabatanModel->getAll();
        foreach ($jabatan as $j) {
            $jabat[] = $j['jabatan'];
            $id_j = $j['id_jabatan'];
            $grap3 = $this->karyawanModel->jabat($id_j);
            $cek3[] = count($grap3);
        }
        $absensi = $this->absensiModel->findAll();

SELECT *
FROM `datadiri`
SELECT *
FROM `keluarga`
SELECT *
FROM `pendidikan`
SELECT *
FROM `bahasa`
SELECT *
FROM `kursus`
SELECT *
FROM `pengalaman`
SELECT *
FROM `kenalan`
SELECT *
FROM `kegiatan`
SELECT *
FROM `keterangan`
SELECT *
FROM `interview`
---
    public function profil_daftar($id)
    {
        $datadiri = $this->datadiriModel->findAll();
        $keluarga = $this->keluargaModel->findAll();
        $pendidikan = $this->pendidikanModel->findAll();
        $bahasa = $this->bahasaModel->findAll();
        $kursus = $this->kursusModel->findAll();
        $pengalaman = $this->pengalamanModel->findAll();
        $kenalan = $this->kenalanModel->findAll();
        $kegiatan = $this->kegiatanModel->findAll();
        $keterangan = $this->keteranganModel->findAll();
        $interview = $this->interviewModel->findAll();