app/Controllers/Login.php

SELECT *
FROM `datadiri`
---
    public function daftar2()
    {
        if (!$this->validate([
            'ktp' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'ktp harus diisi',
                ]
            ],
            'date' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'tanggal lahir harus diisi',
                ]
            ],

        ])) {
            $validation = \Config\Services::validation();
            // dd($validation);
            return redirect()->to('/login/daftar')->withInput()->with('validation', $validation);
        }
        $ktp = $this->request->getVar('ktp');
        $date = $this->request->getVar('date');
        $user = $this->datadiriModel->findAll();