app/Controllers/Recruitment.php

SELECT *
FROM `seleksi`
UPDATE `status_daftar` SET `id_daftar` = '30', `status1` = '1', `updated_at` = '2022-06-03 16:18:04'
WHERE `status_daftar`.`id_status` IN ('28')
UPDATE `lowongan` SET `sisa` = 5, `updated_at` = '2022-06-03 16:18:04'
WHERE `lowongan`.`id_lowongan` IN ('13')
UPDATE `status_daftar` SET `status3` = '1', `updated_at` = '2022-06-03 16:18:04'
WHERE `status_daftar`.`id_status` IN ('28')
UPDATE `seleksi` SET `status_pendaftar` = '1', `updated_at` = '2022-06-03 16:18:04'
WHERE `seleksi`.`id_proses` IN ('24')
---
    public function accept($id, $status, $lowong)
    {
        $lowongan = $this->lowonganModel->getAll();
        $seleksi = $this->seleksiModel->findAll();
        foreach ($seleksi as $s) {
            if ($s['id_proses'] == $id) {
                $this->status_daftarModel->save([
                    'id_status' => $status,
                    'id_daftar' => $s['id_daftar'],
                    'status1' => "1"
                ]);
            }
        }
        foreach ($lowongan as $l) {
            if ($l['id_lowongan'] == $lowong) {
                $sisa = $l['sisa'] - 1;
                $this->lowonganModel->save([
                    'id_lowongan' => $lowong,
                    'sisa' => $sisa,
                ]);
            }
        }
        $this->status_daftarModel->save([
            'id_status' => $status,
            'status3' => "1",
        ]);
        $this->seleksiModel->save([
            'id_proses' => $id,
            'status_pendaftar' => "1",
        ]);