app/Models/AbsensiModel.php

    function grafik($bln, $status)
    {
        $tahun = date("Y");
        $date1 = "$tahun-$bln-1";
        $date2 = "$tahun-$bln-31";
        $db = \Config\Database::connect();
        $builder = $db->table('absensi');
        $builder->where('tanggal_a >=', $date1);
        $builder->where('tanggal_a <=', $date2);
        $builder->where('status_a', $status);
        $query = $builder->get();
---
SELECT *
FROM `absensi`
WHERE `tanggal_a` >= '2022-01-1'
AND `tanggal_a` <= '2022-01-31'
AND `status_a` = 'masuk'