app/Models/JabatanModel.php

SELECT *
FROM `jabatan`
WHERE `enable` = 1
---
    function getAll()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('jabatan');
        $builder->where('enable', 1);
        $query = $builder->get();