app/Models/KaryawanModel.php

SELECT *
FROM `karyawan`
JOIN `datadiri` ON `datadiri`.`id_daftar` = `karyawan`.`id_daftar`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`
WHERE `status_karyawan` = 0
ORDER BY `tgl_diterima` DESC
 LIMIT 5
---
    function masuk2()
    {
        $db = \config\Database::connect();
        $builder = $db->table('karyawan');
        $builder->join('datadiri', 'datadiri.id_daftar = karyawan.id_daftar');
        $builder->join('jabatan', 'jabatan.id_jabatan = karyawan.id_jabatan');
        $builder->where('status_karyawan', 0);
        $builder->orderBy('tgl_diterima', 'DESC');
        $builder->limit(5);
        $query = $builder->get();

SELECT *
FROM `karyawan`
JOIN `datadiri` ON `datadiri`.`id_daftar` = `karyawan`.`id_daftar`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`
WHERE `status_karyawan` = 1
ORDER BY `tgl_keluar` DESC
 LIMIT 5
---
    function resign2()
    {
        $db = \config\Database::connect();
        $builder = $db->table('karyawan');
        $builder->join('datadiri', 'datadiri.id_daftar = karyawan.id_daftar');
        $builder->join('jabatan', 'jabatan.id_jabatan = karyawan.id_jabatan');
        $builder->where('status_karyawan', 1);
        $builder->orderBy('tgl_keluar', 'DESC');
        $builder->limit(5);
        $query = $builder->get();

SELECT *
FROM `karyawan`
WHERE `status_karyawan` = 0
AND `tgl_diterima` >= '2022-01-1'
AND `tgl_diterima` <= '2022-01-31'
---
    function graph_masuk($bulan, $tahun)
    {
        $date1 = "$tahun-$bulan-1";
        $date2 = "$tahun-$bulan-31";
        $db = \Config\Database::connect();
        $builder = $db->table('karyawan');
        $builder->where('status_karyawan', 0);
        $builder->where('tgl_diterima >=', $date1);
        $builder->where('tgl_diterima <=', $date2);
        $query = $builder->get();

SELECT *
FROM `karyawan`
WHERE `status_karyawan` = 1
AND `tgl_diterima` >= '2022-01-1'
AND `tgl_diterima` <= '2022-01-31'
---
    function graph_resign($bulan, $tahun)
    {
        $date1 = "$tahun-$bulan-1";
        $date2 = "$tahun-$bulan-31";
        $db = \Config\Database::connect();
        $builder = $db->table('karyawan');
        $builder->where('status_karyawan', 1);
        $builder->where('tgl_diterima >=', $date1);
        $builder->where('tgl_diterima <=', $date2);
        $query = $builder->get();

SELECT *
FROM `karyawan`
WHERE `status_karyawan` = 0
AND `id_jabatan` = '3'
---
    function jabat($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('karyawan');
        $builder->where('status_karyawan', 0);
        $builder->where('id_jabatan', $id);
        $query = $builder->get();