app/Models/LowonganModel.php

SELECT *
FROM `lowongan`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `lowongan`.`id_jabatan`
---
    function getAll()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('lowongan');
        $builder->join('jabatan', 'jabatan.id_jabatan = lowongan.id_jabatan');
        $query = $builder->get();

SELECT *
FROM `lowongan`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `lowongan`.`id_jabatan`
WHERE `status` = 1
---
    function ada()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('lowongan');
        $builder->join('jabatan', 'jabatan.id_jabatan = lowongan.id_jabatan');
        $builder->where('status', 1);
        $query = $builder->get();