app/Models/SeleksiModel.php

SELECT *
FROM `seleksi`
JOIN `lowongan` ON `lowongan`.`id_lowongan` = `seleksi`.`id_lowongan`
JOIN `datadiri` ON `datadiri`.`id_daftar` = `seleksi`.`id_daftar`
---
    function getAll()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('seleksi');
        $builder->join('lowongan', 'lowongan.id_lowongan = seleksi.id_lowongan');
        $builder->join('datadiri', 'datadiri.id_daftar = seleksi.id_daftar');
        $query = $builder->get();