app/Models/Status_DaftarModel.php

SELECT *
FROM `status_daftar`
JOIN `datadiri` ON `datadiri`.`id_daftar` = `status_daftar`.`id_daftar`
---
    function hasil()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('status_daftar');
        $builder->join('datadiri', 'datadiri.id_daftar = status_daftar.id_daftar');
        $query = $builder->get();

SELECT *
FROM `status_daftar`
JOIN `datadiri` ON `datadiri`.`id_daftar` = `status_daftar`.`id_daftar`
WHERE `status3` = 0
---
    function hasilb()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('status_daftar');
        $builder->join('datadiri', 'datadiri.id_daftar = status_daftar.id_daftar');
        $builder->where('status3', 0);
        $query = $builder->get();